rails-vue-sandbox/app/controllers/test_mvcs_controller.rb

SELECT "test_mvcs".* FROM "test_mvcs"
---
  def index
    @test_mvcs = TestMvc.all

INSERT INTO "test_mvcs" ("content", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "aaaa"], ["text", "aaaaa"], ["created_at", "2018-07-31 09:30:45.880726"], ["updated_at", "2018-07-31 09:30:45.880726"]]
---
  def create
    @test_mvc = TestMvc.new(test_mvc_params)

    respond_to do |format|
      if @test_mvc.save

UPDATE "test_mvcs" SET "content" = ?, "text" = ?, "updated_at" = ? WHERE "test_mvcs"."id" = ?  [["content", "wrebsf"], ["text", "wergsbg"], ["updated_at", "2018-08-02 03:34:52.218145"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @test_mvc.update(test_mvc_params)

DELETE FROM "test_mvcs" WHERE "test_mvcs"."id" = ?  [["id", 1]]
---
  def destroy
    @test_mvc.destroy

SELECT  "test_mvcs".* FROM "test_mvcs" WHERE "test_mvcs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_test_mvc
      @test_mvc = TestMvc.find(params[:id])